In [2]:
import pandas as pd
import requests

df2024= pd.read_html('https://www.nirfindia.org/Rankings/2024/OverallRanking.html')
result = df2024[0]

In [3]:
result.head()

,Institute ID,Name,City,State,Score,Rank
0,IR-O-U-0456,Indian Institute of Technology MadrasMore Deta...,Chennai,Tamil Nadu,86.42,1
1,IR-O-U-0220,"Indian Institute of Science, BengaluruMore Det...",Bengaluru,Karnataka,83.28,2
2,IR-O-U-0306,Indian Institute of Technology BombayMore Deta...,Mumbai,Maharashtra,81.37,3
3,IR-O-I-1074,Indian Institute of Technology DelhiMore Detai...,New Delhi,Delhi,80.31,4
4,IR-O-I-1075,Indian Institute of Technology KanpurMore Deta...,Kanpur,Uttar Pradesh,77.56,5

In [8]:
edf = pd.DataFrame()
for l in df2024[1:]:
    edf = pd.concat([edf, l ])
    #print(l)
edf.head()

   TLR (100)  RPC (100)  GO (100)  OI (100)  PERCEPTION (100)
0      88.37      87.30     85.76     65.68            100.00
0      83.60      86.50     82.17     58.46             99.70
0      83.85      82.35     83.36     59.05             89.32
0      76.57      86.23     77.48     66.23             93.48
0      89.84      69.09     81.96     60.83             74.12

In [9]:
#df2024[1:]

In [1]:
# df1 = pd.concat([result, edf], ignore_index=True)
result = result.reset_index(drop=True)
edf = edf.reset_index(drop=True)

df1 = pd.concat([result, edf], axis=1)
#df1 = df1.reset_index(drop=True)
df1['Year']= 2024
print(df1)

NameError: name 'result' is not defined